# LinearForceScale Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..LinearForceScale Property
SpecTypeId Class See Also
---
Linear Force Scale, in discipline Structural.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId LinearForceScale { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LinearForceScale As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LinearForceScale {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace